garyPenhook/PIC-Assembler/device_includes/pic18f45q71.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0153h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0154h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h

// Register: APMCON
#define APMCON APMCON
APMCON                                   equ 01C0h
// bitfield definitions
APMCON_EN_POSN                           equ 0007h
APMCON_EN_POSITION                       equ 0007h
APMCON_EN_SIZE                           equ 0001h
APMCON_EN_LENGTH                         equ 0001h
APMCON_EN_MASK                           equ 0080h
APMCON_APMEN_POSN                        equ 0007h
APMCON_APMEN_POSITION                    equ 0007h
APMCON_APMEN_SIZE                        equ 0001h
APMCON_APMEN_LENGTH                      equ 0001h
APMCON_APMEN_MASK                        equ 0080h

// Register: APMPRE
#define APMPRE APMPRE
APMPRE                                   equ 01C1h

// Register: APMPREL
#define APMPREL APMPREL
APMPREL                                  equ 01C1h
// bitfield definitions
APMPREL_PRE_POSN                         equ 0000h
APMPREL_PRE_POSITION                     equ 0000h
APMPREL_PRE_SIZE                         equ 0008h
APMPREL_PRE_LENGTH                       equ 0008h
APMPREL_PRE_MASK                         equ 00FFh
APMPREL_PRE0_POSN                        equ 0000h
APMPREL_PRE0_POSITION                    equ 0000h
APMPREL_PRE0_SIZE                        equ 0001h
APMPREL_PRE0_LENGTH                      equ 0001h
APMPREL_PRE0_MASK                        equ 0001h
APMPREL_PRE1_POSN                        equ 0001h
APMPREL_PRE1_POSITION                    equ 0001h
APMPREL_PRE1_SIZE                        equ 0001h
APMPREL_PRE1_LENGTH                      equ 0001h
APMPREL_PRE1_MASK                        equ 0002h
APMPREL_PRE2_POSN                        equ 0002h
APMPREL_PRE2_POSITION                    equ 0002h
APMPREL_PRE2_SIZE                        equ 0001h
APMPREL_PRE2_LENGTH                      equ 0001h
APMPREL_PRE2_MASK                        equ 0004h
APMPREL_PRE3_POSN                        equ 0003h
APMPREL_PRE3_POSITION                    equ 0003h
APMPREL_PRE3_SIZE                        equ 0001h
APMPREL_PRE3_LENGTH                      equ 0001h
APMPREL_PRE3_MASK                        equ 0008h
APMPREL_PRE4_POSN                        equ 0004h
APMPREL_PRE4_POSITION                    equ 0004h
APMPREL_PRE4_SIZE                        equ 0001h
APMPREL_PRE4_LENGTH                      equ 0001h
APMPREL_PRE4_MASK                        equ 0010h
APMPREL_PRE5_POSN                        equ 0005h
APMPREL_PRE5_POSITION                    equ 0005h
APMPREL_PRE5_SIZE                        equ 0001h
APMPREL_PRE5_LENGTH                      equ 0001h
APMPREL_PRE5_MASK                        equ 0020h
APMPREL_PRE6_POSN                        equ 0006h
APMPREL_PRE6_POSITION                    equ 0006h
APMPREL_PRE6_SIZE                        equ 0001h
APMPREL_PRE6_LENGTH                      equ 0001h
APMPREL_PRE6_MASK                        equ 0040h
APMPREL_PRE7_POSN                        equ 0007h
APMPREL_PRE7_POSITION                    equ 0007h
APMPREL_PRE7_SIZE                        equ 0001h
APMPREL_PRE7_LENGTH                      equ 0001h
APMPREL_PRE7_MASK                        equ 0080h
APMPREL_APMPRE_POSN                      equ 0000h
APMPREL_APMPRE_POSITION                  equ 0000h
APMPREL_APMPRE_SIZE                      equ 0008h
APMPREL_APMPRE_LENGTH                    equ 0008h
APMPREL_APMPRE_MASK                      equ 00FFh
APMPREL_APMPRE0_POSN                     equ 0000h
APMPREL_APMPRE0_POSITION                 equ 0000h
APMPREL_APMPRE0_SIZE                     equ 0001h
APMPREL_APMPRE0_LENGTH                   equ 0001h
APMPREL_APMPRE0_MASK                     equ 0001h
APMPREL_APMPRE1_POSN                     equ 0001h
APMPREL_APMPRE1_POSITION                 equ 0001h
APMPREL_APMPRE1_SIZE                     equ 0001h
APMPREL_APMPRE1_LENGTH                   equ 0001h
APMPREL_APMPRE1_MASK                     equ 0002h
APMPREL_APMPRE2_POSN                     equ 0002h
APMPREL_APMPRE2_POSITION                 equ 0002h
APMPREL_APMPRE2_SIZE                     equ 0001h
APMPREL_APMPRE2_LENGTH                   equ 0001h
APMPREL_APMPRE2_MASK                     equ 0004h
APMPREL_APMPRE3_POSN                     equ 0003h
APMPREL_APMPRE3_POSITION                 equ 0003h
APMPREL_APMPRE3_SIZE                     equ 0001h
APMPREL_APMPRE3_LENGTH                   equ 0001h
APMPREL_APMPRE3_MASK                     equ 0008h
APMPREL_APMPRE4_POSN                     equ 0004h
APMPREL_APMPRE4_POSITION                 equ 0004h
APMPREL_APMPRE4_SIZE                     equ 0001h
APMPREL_APMPRE4_LENGTH                   equ 0001h
APMPREL_APMPRE4_MASK                     equ 0010h
APMPREL_APMPRE5_POSN                     equ 0005h
APMPREL_APMPRE5_POSITION                 equ 0005h
APMPREL_APMPRE5_SIZE                     equ 0001h
APMPREL_APMPRE5_LENGTH                   equ 0001h
APMPREL_APMPRE5_MASK                     equ 0020h
APMPREL_APMPRE6_POSN                     equ 0006h
APMPREL_APMPRE6_POSITION                 equ 0006h
APMPREL_APMPRE6_SIZE                     equ 0001h
APMPREL_APMPRE6_LENGTH                   equ 0001h
APMPREL_APMPRE6_MASK                     equ 0040h
APMPREL_APMPRE7_POSN                     equ 0007h
APMPREL_APMPRE7_POSITION                 equ 0007h
APMPREL_APMPRE7_SIZE                     equ 0001h
APMPREL_APMPRE7_LENGTH                   equ 0001h
APMPREL_APMPRE7_MASK                     equ 0080h

// Register: APMPREH
#define APMPREH APMPREH
APMPREH                                  equ 01C2h
// bitfield definitions
APMPREH_PRE_POSN                         equ 0000h
APMPREH_PRE_POSITION                     equ 0000h
APMPREH_PRE_SIZE                         equ 0008h
APMPREH_PRE_LENGTH                       equ 0008h
APMPREH_PRE_MASK                         equ 00FFh
APMPREH_PRE8_POSN                        equ 0000h
APMPREH_PRE8_POSITION                    equ 0000h
APMPREH_PRE8_SIZE                        equ 0001h
APMPREH_PRE8_LENGTH                      equ 0001h
APMPREH_PRE8_MASK                        equ 0001h
APMPREH_PRE9_POSN                        equ 0001h
APMPREH_PRE9_POSITION                    equ 0001h
APMPREH_PRE9_SIZE                        equ 0001h
APMPREH_PRE9_LENGTH                      equ 0001h
APMPREH_PRE9_MASK                        equ 0002h
APMPREH_PRE10_POSN                       equ 0002h
APMPREH_PRE10_POSITION                   equ 0002h
APMPREH_PRE10_SIZE                       equ 0001h
APMPREH_PRE10_LENGTH                     equ 0001h
APMPREH_PRE10_MASK                       equ 0004h
APMPREH_PRE11_POSN                       equ 0003h
APMPREH_PRE11_POSITION                   equ 0003h
APMPREH_PRE11_SIZE                       equ 0001h
APMPREH_PRE11_LENGTH                     equ 0001h
APMPREH_PRE11_MASK                       equ 0008h
APMPREH_PRE12_POSN                       equ 0004h
APMPREH_PRE12_POSITION                   equ 0004h
APMPREH_PRE12_SIZE                       equ 0001h
APMPREH_PRE12_LENGTH                     equ 0001h
APMPREH_PRE12_MASK                       equ 0010h
APMPREH_PRE13_POSN                       equ 0005h
APMPREH_PRE13_POSITION                   equ 0005h
APMPREH_PRE13_SIZE                       equ 0001h
APMPREH_PRE13_LENGTH                     equ 0001h
APMPREH_PRE13_MASK                       equ 0020h
APMPREH_PRE14_POSN                       equ 0006h
APMPREH_PRE14_POSITION                   equ 0006h
APMPREH_PRE14_SIZE                       equ 0001h
APMPREH_PRE14_LENGTH                     equ 0001h
APMPREH_PRE14_MASK                       equ 0040h
APMPREH_PRE15_POSN                       equ 0007h
APMPREH_PRE15_POSITION                   equ 0007h
APMPREH_PRE15_SIZE                       equ 0001h
APMPREH_PRE15_LENGTH                     equ 0001h
APMPREH_PRE15_MASK                       equ 0080h
APMPREH_APMPRE_POSN                      equ 0000h
APMPREH_APMPRE_POSITION                  equ 0000h
APMPREH_APMPRE_SIZE                      equ 0008h
APMPREH_APMPRE_LENGTH                    equ 0008h
APMPREH_APMPRE_MASK                      equ 00FFh
APMPREH_APMPRE8_POSN                     equ 0000h
APMPREH_APMPRE8_POSITION                 equ 0000h
APMPREH_APMPRE8_SIZE                     equ 0001h
APMPREH_APMPRE8_LENGTH                   equ 0001h
APMPREH_APMPRE8_MASK                     equ 0001h
APMPREH_APMPRE9_POSN                     equ 0001h
APMPREH_APMPRE9_POSITION                 equ 0001h
APMPREH_APMPRE9_SIZE                     equ 0001h
APMPREH_APMPRE9_LENGTH                   equ 0001h
APMPREH_APMPRE9_MASK                     equ 0002h
APMPREH_APMPRE10_POSN                    equ 0002h
APMPREH_APMPRE10_POSITION                equ 0002h
APMPREH_APMPRE10_SIZE                    equ 0001h
APMPREH_APMPRE10_LENGTH                  equ 0001h
APMPREH_APMPRE10_MASK                    equ 0004h
APMPREH_APMPRE11_POSN                    equ 0003h
APMPREH_APMPRE11_POSITION                equ 0003h
APMPREH_APMPRE11_SIZE                    equ 0001h
APMPREH_APMPRE11_LENGTH                  equ 0001h
APMPREH_APMPRE11_MASK                    equ 0008h
APMPREH_APMPRE12_POSN                    equ 0004h
APMPREH_APMPRE12_POSITION                equ 0004h
APMPREH_APMPRE12_SIZE                    equ 0001h
APMPREH_APMPRE12_LENGTH                  equ 0001h
APMPREH_APMPRE12_MASK                    equ 0010h
APMPREH_APMPRE13_POSN                    equ 0005h
APMPREH_APMPRE13_POSITION                equ 0005h
APMPREH_APMPRE13_SIZE                    equ 0001h
APMPREH_APMPRE13_LENGTH                  equ 0001h
APMPREH_APMPRE13_MASK                    equ 0020h
APMPREH_APMPRE14_POSN                    equ 0006h
APMPREH_APMPRE14_POSITION                equ 0006h
APMPREH_APMPRE14_SIZE                    equ 0001h
APMPREH_APMPRE14_LENGTH                  equ 0001h
APMPREH_APMPRE14_MASK                    equ 0040h
APMPREH_APMPRE15_POSN                    equ 0007h
APMPREH_APMPRE15_POSITION                equ 0007h
APMPREH_APMPRE15_SIZE                    equ 0001h
APMPREH_APMPRE15_LENGTH                  equ 0001h
APMPREH_APMPRE15_MASK                    equ 0080h

// Register: APMPER
#define APMPER APMPER
APMPER                                   equ 01C3h

