garyPenhook/PIC-Assembler/device_includes/pic18f45q71.inc
// Register: APMPERL
#define APMPERL APMPERL
APMPERL                                  equ 01C3h
// bitfield definitions
APMPERL_PER_POSN                         equ 0000h
APMPERL_PER_POSITION                     equ 0000h
APMPERL_PER_SIZE                         equ 0008h
APMPERL_PER_LENGTH                       equ 0008h
APMPERL_PER_MASK                         equ 00FFh
APMPERL_PER0_POSN                        equ 0000h
APMPERL_PER0_POSITION                    equ 0000h
APMPERL_PER0_SIZE                        equ 0001h
APMPERL_PER0_LENGTH                      equ 0001h
APMPERL_PER0_MASK                        equ 0001h
APMPERL_PER1_POSN                        equ 0001h
APMPERL_PER1_POSITION                    equ 0001h
APMPERL_PER1_SIZE                        equ 0001h
APMPERL_PER1_LENGTH                      equ 0001h
APMPERL_PER1_MASK                        equ 0002h
APMPERL_PER2_POSN                        equ 0002h
APMPERL_PER2_POSITION                    equ 0002h
APMPERL_PER2_SIZE                        equ 0001h
APMPERL_PER2_LENGTH                      equ 0001h
APMPERL_PER2_MASK                        equ 0004h
APMPERL_PER3_POSN                        equ 0003h
APMPERL_PER3_POSITION                    equ 0003h
APMPERL_PER3_SIZE                        equ 0001h
APMPERL_PER3_LENGTH                      equ 0001h
APMPERL_PER3_MASK                        equ 0008h
APMPERL_PER4_POSN                        equ 0004h
APMPERL_PER4_POSITION                    equ 0004h
APMPERL_PER4_SIZE                        equ 0001h
APMPERL_PER4_LENGTH                      equ 0001h
APMPERL_PER4_MASK                        equ 0010h
APMPERL_PER5_POSN                        equ 0005h
APMPERL_PER5_POSITION                    equ 0005h
APMPERL_PER5_SIZE                        equ 0001h
APMPERL_PER5_LENGTH                      equ 0001h
APMPERL_PER5_MASK                        equ 0020h
APMPERL_PER6_POSN                        equ 0006h
APMPERL_PER6_POSITION                    equ 0006h
APMPERL_PER6_SIZE                        equ 0001h
APMPERL_PER6_LENGTH                      equ 0001h
APMPERL_PER6_MASK                        equ 0040h
APMPERL_PER7_POSN                        equ 0007h
APMPERL_PER7_POSITION                    equ 0007h
APMPERL_PER7_SIZE                        equ 0001h
APMPERL_PER7_LENGTH                      equ 0001h
APMPERL_PER7_MASK                        equ 0080h
APMPERL_APMPER_POSN                      equ 0000h
APMPERL_APMPER_POSITION                  equ 0000h
APMPERL_APMPER_SIZE                      equ 0008h
APMPERL_APMPER_LENGTH                    equ 0008h
APMPERL_APMPER_MASK                      equ 00FFh
APMPERL_APMPER0_POSN                     equ 0000h
APMPERL_APMPER0_POSITION                 equ 0000h
APMPERL_APMPER0_SIZE                     equ 0001h
APMPERL_APMPER0_LENGTH                   equ 0001h
APMPERL_APMPER0_MASK                     equ 0001h
APMPERL_APMPER1_POSN                     equ 0001h
APMPERL_APMPER1_POSITION                 equ 0001h
APMPERL_APMPER1_SIZE                     equ 0001h
APMPERL_APMPER1_LENGTH                   equ 0001h
APMPERL_APMPER1_MASK                     equ 0002h
APMPERL_APMPER2_POSN                     equ 0002h
APMPERL_APMPER2_POSITION                 equ 0002h
APMPERL_APMPER2_SIZE                     equ 0001h
APMPERL_APMPER2_LENGTH                   equ 0001h
APMPERL_APMPER2_MASK                     equ 0004h
APMPERL_APMPER3_POSN                     equ 0003h
APMPERL_APMPER3_POSITION                 equ 0003h
APMPERL_APMPER3_SIZE                     equ 0001h
APMPERL_APMPER3_LENGTH                   equ 0001h
APMPERL_APMPER3_MASK                     equ 0008h
APMPERL_APMPER4_POSN                     equ 0004h
APMPERL_APMPER4_POSITION                 equ 0004h
APMPERL_APMPER4_SIZE                     equ 0001h
APMPERL_APMPER4_LENGTH                   equ 0001h
APMPERL_APMPER4_MASK                     equ 0010h
APMPERL_APMPER5_POSN                     equ 0005h
APMPERL_APMPER5_POSITION                 equ 0005h
APMPERL_APMPER5_SIZE                     equ 0001h
APMPERL_APMPER5_LENGTH                   equ 0001h
APMPERL_APMPER5_MASK                     equ 0020h
APMPERL_APMPER6_POSN                     equ 0006h
APMPERL_APMPER6_POSITION                 equ 0006h
APMPERL_APMPER6_SIZE                     equ 0001h
APMPERL_APMPER6_LENGTH                   equ 0001h
APMPERL_APMPER6_MASK                     equ 0040h
APMPERL_APMPER7_POSN                     equ 0007h
APMPERL_APMPER7_POSITION                 equ 0007h
APMPERL_APMPER7_SIZE                     equ 0001h
APMPERL_APMPER7_LENGTH                   equ 0001h
APMPERL_APMPER7_MASK                     equ 0080h

// Register: APMPERH
#define APMPERH APMPERH
APMPERH                                  equ 01C4h
// bitfield definitions
APMPERH_PER_POSN                         equ 0000h
APMPERH_PER_POSITION                     equ 0000h
APMPERH_PER_SIZE                         equ 0008h
APMPERH_PER_LENGTH                       equ 0008h
APMPERH_PER_MASK                         equ 00FFh
APMPERH_PER8_POSN                        equ 0000h
APMPERH_PER8_POSITION                    equ 0000h
APMPERH_PER8_SIZE                        equ 0001h
APMPERH_PER8_LENGTH                      equ 0001h
APMPERH_PER8_MASK                        equ 0001h
APMPERH_PER9_POSN                        equ 0001h
APMPERH_PER9_POSITION                    equ 0001h
APMPERH_PER9_SIZE                        equ 0001h
APMPERH_PER9_LENGTH                      equ 0001h
APMPERH_PER9_MASK                        equ 0002h
APMPERH_PER10_POSN                       equ 0002h
APMPERH_PER10_POSITION                   equ 0002h
APMPERH_PER10_SIZE                       equ 0001h
APMPERH_PER10_LENGTH                     equ 0001h
APMPERH_PER10_MASK                       equ 0004h
APMPERH_PER11_POSN                       equ 0003h
APMPERH_PER11_POSITION                   equ 0003h
APMPERH_PER11_SIZE                       equ 0001h
APMPERH_PER11_LENGTH                     equ 0001h
APMPERH_PER11_MASK                       equ 0008h
APMPERH_PER12_POSN                       equ 0004h
APMPERH_PER12_POSITION                   equ 0004h
APMPERH_PER12_SIZE                       equ 0001h
APMPERH_PER12_LENGTH                     equ 0001h
APMPERH_PER12_MASK                       equ 0010h
APMPERH_PER13_POSN                       equ 0005h
APMPERH_PER13_POSITION                   equ 0005h
APMPERH_PER13_SIZE                       equ 0001h
APMPERH_PER13_LENGTH                     equ 0001h
APMPERH_PER13_MASK                       equ 0020h
APMPERH_PER14_POSN                       equ 0006h
APMPERH_PER14_POSITION                   equ 0006h
APMPERH_PER14_SIZE                       equ 0001h
APMPERH_PER14_LENGTH                     equ 0001h
APMPERH_PER14_MASK                       equ 0040h
APMPERH_PER15_POSN                       equ 0007h
APMPERH_PER15_POSITION                   equ 0007h
APMPERH_PER15_SIZE                       equ 0001h
APMPERH_PER15_LENGTH                     equ 0001h
APMPERH_PER15_MASK                       equ 0080h
APMPERH_APMPER_POSN                      equ 0000h
APMPERH_APMPER_POSITION                  equ 0000h
APMPERH_APMPER_SIZE                      equ 0008h
APMPERH_APMPER_LENGTH                    equ 0008h
APMPERH_APMPER_MASK                      equ 00FFh
APMPERH_APMPER8_POSN                     equ 0000h
APMPERH_APMPER8_POSITION                 equ 0000h
APMPERH_APMPER8_SIZE                     equ 0001h
APMPERH_APMPER8_LENGTH                   equ 0001h
APMPERH_APMPER8_MASK                     equ 0001h
APMPERH_APMPER9_POSN                     equ 0001h
APMPERH_APMPER9_POSITION                 equ 0001h
APMPERH_APMPER9_SIZE                     equ 0001h
APMPERH_APMPER9_LENGTH                   equ 0001h
APMPERH_APMPER9_MASK                     equ 0002h
APMPERH_APMPER10_POSN                    equ 0002h
APMPERH_APMPER10_POSITION                equ 0002h
APMPERH_APMPER10_SIZE                    equ 0001h
APMPERH_APMPER10_LENGTH                  equ 0001h
APMPERH_APMPER10_MASK                    equ 0004h
APMPERH_APMPER11_POSN                    equ 0003h
APMPERH_APMPER11_POSITION                equ 0003h
APMPERH_APMPER11_SIZE                    equ 0001h
APMPERH_APMPER11_LENGTH                  equ 0001h
APMPERH_APMPER11_MASK                    equ 0008h
APMPERH_APMPER12_POSN                    equ 0004h
APMPERH_APMPER12_POSITION                equ 0004h
APMPERH_APMPER12_SIZE                    equ 0001h
APMPERH_APMPER12_LENGTH                  equ 0001h
APMPERH_APMPER12_MASK                    equ 0010h
APMPERH_APMPER13_POSN                    equ 0005h
APMPERH_APMPER13_POSITION                equ 0005h
APMPERH_APMPER13_SIZE                    equ 0001h
APMPERH_APMPER13_LENGTH                  equ 0001h
APMPERH_APMPER13_MASK                    equ 0020h
APMPERH_APMPER14_POSN                    equ 0006h
APMPERH_APMPER14_POSITION                equ 0006h
APMPERH_APMPER14_SIZE                    equ 0001h
APMPERH_APMPER14_LENGTH                  equ 0001h
APMPERH_APMPER14_MASK                    equ 0040h
APMPERH_APMPER15_POSN                    equ 0007h
APMPERH_APMPER15_POSITION                equ 0007h
APMPERH_APMPER15_SIZE                    equ 0001h
APMPERH_APMPER15_LENGTH                  equ 0001h
APMPERH_APMPER15_MASK                    equ 0080h

// Register: APMSTART1
#define APMSTART1 APMSTART1
APMSTART1                                equ 01C5h

// Register: APMSTART1L
#define APMSTART1L APMSTART1L
APMSTART1L                               equ 01C5h
// bitfield definitions
APMSTART1L_START1_POSN                   equ 0000h
APMSTART1L_START1_POSITION               equ 0000h
APMSTART1L_START1_SIZE                   equ 0008h
APMSTART1L_START1_LENGTH                 equ 0008h
APMSTART1L_START1_MASK                   equ 00FFh

// Register: APMSTART1H
#define APMSTART1H APMSTART1H
APMSTART1H                               equ 01C6h
// bitfield definitions
APMSTART1H_START1_POSN                   equ 0000h
APMSTART1H_START1_POSITION               equ 0000h
APMSTART1H_START1_SIZE                   equ 0008h
APMSTART1H_START1_LENGTH                 equ 0008h
APMSTART1H_START1_MASK                   equ 00FFh

// Register: APMPERS1
#define APMPERS1 APMPERS1
APMPERS1                                 equ 01C7h

// Register: APMPERS1L
#define APMPERS1L APMPERS1L
APMPERS1L                                equ 01C7h
// bitfield definitions
APMPERS1L_APMPERS1_POSN                  equ 0000h
APMPERS1L_APMPERS1_POSITION              equ 0000h
APMPERS1L_APMPERS1_SIZE                  equ 0008h
APMPERS1L_APMPERS1_LENGTH                equ 0008h
APMPERS1L_APMPERS1_MASK                  equ 00FFh
APMPERS1L_BG_POSN                        equ 0002h
APMPERS1L_BG_POSITION                    equ 0002h
APMPERS1L_BG_SIZE                        equ 0001h
APMPERS1L_BG_LENGTH                      equ 0001h
APMPERS1L_BG_MASK                        equ 0004h
APMPERS1L_FVR1_POSN                      equ 0003h
APMPERS1L_FVR1_POSITION                  equ 0003h
APMPERS1L_FVR1_SIZE                      equ 0001h
APMPERS1L_FVR1_LENGTH                    equ 0001h
APMPERS1L_FVR1_MASK                      equ 0008h
APMPERS1L_FVR2_POSN                      equ 0004h
APMPERS1L_FVR2_POSITION                  equ 0004h
APMPERS1L_FVR2_SIZE                      equ 0001h
APMPERS1L_FVR2_LENGTH                    equ 0001h
APMPERS1L_FVR2_MASK                      equ 0010h
APMPERS1L_ADCD_POSN                      equ 0005h
APMPERS1L_ADCD_POSITION                  equ 0005h
APMPERS1L_ADCD_SIZE                      equ 0001h
APMPERS1L_ADCD_LENGTH                    equ 0001h
APMPERS1L_ADCD_MASK                      equ 0020h
APMPERS1L_ADCA_POSN                      equ 0006h
APMPERS1L_ADCA_POSITION                  equ 0006h
APMPERS1L_ADCA_SIZE                      equ 0001h
APMPERS1L_ADCA_LENGTH                    equ 0001h
APMPERS1L_ADCA_MASK                      equ 0040h
APMPERS1L_TEMP_POSN                      equ 0007h
APMPERS1L_TEMP_POSITION                  equ 0007h
APMPERS1L_TEMP_SIZE                      equ 0001h
APMPERS1L_TEMP_LENGTH                    equ 0001h
APMPERS1L_TEMP_MASK                      equ 0080h
APMPERS1L_APMPERS1_2_POSN                equ 0002h
APMPERS1L_APMPERS1_2_POSITION            equ 0002h
APMPERS1L_APMPERS1_2_SIZE                equ 0001h
APMPERS1L_APMPERS1_2_LENGTH              equ 0001h
APMPERS1L_APMPERS1_2_MASK                equ 0004h
APMPERS1L_APMPERS1_3_POSN                equ 0003h
APMPERS1L_APMPERS1_3_POSITION            equ 0003h
APMPERS1L_APMPERS1_3_SIZE                equ 0001h
APMPERS1L_APMPERS1_3_LENGTH              equ 0001h
APMPERS1L_APMPERS1_3_MASK                equ 0008h
APMPERS1L_APMPERS1_4_POSN                equ 0004h
APMPERS1L_APMPERS1_4_POSITION            equ 0004h
APMPERS1L_APMPERS1_4_SIZE                equ 0001h
APMPERS1L_APMPERS1_4_LENGTH              equ 0001h
APMPERS1L_APMPERS1_4_MASK                equ 0010h
APMPERS1L_APMPERS1_5_POSN                equ 0005h
APMPERS1L_APMPERS1_5_POSITION            equ 0005h
APMPERS1L_APMPERS1_5_SIZE                equ 0001h
APMPERS1L_APMPERS1_5_LENGTH              equ 0001h
APMPERS1L_APMPERS1_5_MASK                equ 0020h
APMPERS1L_APMPERS1_6_POSN                equ 0006h
APMPERS1L_APMPERS1_6_POSITION            equ 0006h
APMPERS1L_APMPERS1_6_SIZE                equ 0001h
APMPERS1L_APMPERS1_6_LENGTH              equ 0001h
APMPERS1L_APMPERS1_6_MASK                equ 0040h
APMPERS1L_APMPERS1_7_POSN                equ 0007h
APMPERS1L_APMPERS1_7_POSITION            equ 0007h
APMPERS1L_APMPERS1_7_SIZE                equ 0001h
APMPERS1L_APMPERS1_7_LENGTH              equ 0001h
APMPERS1L_APMPERS1_7_MASK                equ 0080h

// Register: APMPERS1H
#define APMPERS1H APMPERS1H
APMPERS1H                                equ 01C8h
// bitfield definitions
APMPERS1H_APMPERS1_POSN                  equ 0000h
APMPERS1H_APMPERS1_POSITION              equ 0000h
APMPERS1H_APMPERS1_SIZE                  equ 0008h
APMPERS1H_APMPERS1_LENGTH                equ 0008h
APMPERS1H_APMPERS1_MASK                  equ 00FFh
APMPERS1H_OPA1_POSN                      equ 0000h
APMPERS1H_OPA1_POSITION                  equ 0000h
APMPERS1H_OPA1_SIZE                      equ 0001h
APMPERS1H_OPA1_LENGTH                    equ 0001h
APMPERS1H_OPA1_MASK                      equ 0001h
APMPERS1H_OPA2_POSN                      equ 0001h
APMPERS1H_OPA2_POSITION                  equ 0001h
APMPERS1H_OPA2_SIZE                      equ 0001h
APMPERS1H_OPA2_LENGTH                    equ 0001h
APMPERS1H_OPA2_MASK                      equ 0002h
APMPERS1H_DAC1_POSN                      equ 0002h
APMPERS1H_DAC1_POSITION                  equ 0002h
APMPERS1H_DAC1_SIZE                      equ 0001h
APMPERS1H_DAC1_LENGTH                    equ 0001h
APMPERS1H_DAC1_MASK                      equ 0004h
APMPERS1H_DAC2_POSN                      equ 0003h
APMPERS1H_DAC2_POSITION                  equ 0003h
APMPERS1H_DAC2_SIZE                      equ 0001h
APMPERS1H_DAC2_LENGTH                    equ 0001h
APMPERS1H_DAC2_MASK                      equ 0008h
APMPERS1H_DAC3_POSN                      equ 0004h
APMPERS1H_DAC3_POSITION                  equ 0004h
APMPERS1H_DAC3_SIZE                      equ 0001h
APMPERS1H_DAC3_LENGTH                    equ 0001h
APMPERS1H_DAC3_MASK                      equ 0010h
APMPERS1H_CMP1_POSN                      equ 0005h
APMPERS1H_CMP1_POSITION                  equ 0005h
APMPERS1H_CMP1_SIZE                      equ 0001h
APMPERS1H_CMP1_LENGTH                    equ 0001h
APMPERS1H_CMP1_MASK                      equ 0020h
APMPERS1H_CMP2_POSN                      equ 0006h
APMPERS1H_CMP2_POSITION                  equ 0006h
APMPERS1H_CMP2_SIZE                      equ 0001h
APMPERS1H_CMP2_LENGTH                    equ 0001h
APMPERS1H_CMP2_MASK                      equ 0040h
APMPERS1H_ZCD_POSN                       equ 0007h
APMPERS1H_ZCD_POSITION                   equ 0007h
APMPERS1H_ZCD_SIZE                       equ 0001h
APMPERS1H_ZCD_LENGTH                     equ 0001h
APMPERS1H_ZCD_MASK                       equ 0080h
APMPERS1H_APMPERS1_8_POSN                equ 0000h
APMPERS1H_APMPERS1_8_POSITION            equ 0000h
APMPERS1H_APMPERS1_8_SIZE                equ 0001h
APMPERS1H_APMPERS1_8_LENGTH              equ 0001h
APMPERS1H_APMPERS1_8_MASK                equ 0001h
APMPERS1H_APMPERS1_9_POSN                equ 0001h
APMPERS1H_APMPERS1_9_POSITION            equ 0001h
APMPERS1H_APMPERS1_9_SIZE                equ 0001h
APMPERS1H_APMPERS1_9_LENGTH              equ 0001h
APMPERS1H_APMPERS1_9_MASK                equ 0002h
APMPERS1H_APMPERS1_10_POSN               equ 0002h
APMPERS1H_APMPERS1_10_POSITION           equ 0002h
APMPERS1H_APMPERS1_10_SIZE               equ 0001h
APMPERS1H_APMPERS1_10_LENGTH             equ 0001h
APMPERS1H_APMPERS1_10_MASK               equ 0004h
APMPERS1H_APMPERS1_11_POSN               equ 0003h
APMPERS1H_APMPERS1_11_POSITION           equ 0003h
APMPERS1H_APMPERS1_11_SIZE               equ 0001h
APMPERS1H_APMPERS1_11_LENGTH             equ 0001h
APMPERS1H_APMPERS1_11_MASK               equ 0008h
APMPERS1H_APMPERS1_12_POSN               equ 0004h
APMPERS1H_APMPERS1_12_POSITION           equ 0004h
APMPERS1H_APMPERS1_12_SIZE               equ 0001h
APMPERS1H_APMPERS1_12_LENGTH             equ 0001h
APMPERS1H_APMPERS1_12_MASK               equ 0010h
APMPERS1H_APMPERS1_13_POSN               equ 0005h
APMPERS1H_APMPERS1_13_POSITION           equ 0005h
APMPERS1H_APMPERS1_13_SIZE               equ 0001h
APMPERS1H_APMPERS1_13_LENGTH             equ 0001h
APMPERS1H_APMPERS1_13_MASK               equ 0020h
APMPERS1H_APMPERS1_14_POSN               equ 0006h
APMPERS1H_APMPERS1_14_POSITION           equ 0006h
APMPERS1H_APMPERS1_14_SIZE               equ 0001h
APMPERS1H_APMPERS1_14_LENGTH             equ 0001h
APMPERS1H_APMPERS1_14_MASK               equ 0040h
APMPERS1H_APMPERS1_15_POSN               equ 0007h
APMPERS1H_APMPERS1_15_POSITION           equ 0007h
APMPERS1H_APMPERS1_15_SIZE               equ 0001h
APMPERS1H_APMPERS1_15_LENGTH             equ 0001h
APMPERS1H_APMPERS1_15_MASK               equ 0080h

