garyPenhook/PIC-Assembler/device_includes/pic18f45q71.inc
// Register: APMCLKPPS
#define APMCLKPPS APMCLKPPS
APMCLKPPS                                equ 027Ah
// bitfield definitions
APMCLKPPS_PIN_POSN                       equ 0000h
APMCLKPPS_PIN_POSITION                   equ 0000h
APMCLKPPS_PIN_SIZE                       equ 0003h
APMCLKPPS_PIN_LENGTH                     equ 0003h
APMCLKPPS_PIN_MASK                       equ 0007h
APMCLKPPS_PORT_POSN                      equ 0003h
APMCLKPPS_PORT_POSITION                  equ 0003h
APMCLKPPS_PORT_SIZE                      equ 0003h
APMCLKPPS_PORT_LENGTH                    equ 0003h
APMCLKPPS_PORT_MASK                      equ 0038h
APMCLKPPS_APMCLKPPS0_POSN                equ 0000h
APMCLKPPS_APMCLKPPS0_POSITION            equ 0000h
APMCLKPPS_APMCLKPPS0_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS0_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS0_MASK                equ 0001h
APMCLKPPS_APMCLKPPS1_POSN                equ 0001h
APMCLKPPS_APMCLKPPS1_POSITION            equ 0001h
APMCLKPPS_APMCLKPPS1_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS1_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS1_MASK                equ 0002h
APMCLKPPS_APMCLKPPS2_POSN                equ 0002h
APMCLKPPS_APMCLKPPS2_POSITION            equ 0002h
APMCLKPPS_APMCLKPPS2_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS2_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS2_MASK                equ 0004h
APMCLKPPS_APMCLKPPS3_POSN                equ 0003h
APMCLKPPS_APMCLKPPS3_POSITION            equ 0003h
APMCLKPPS_APMCLKPPS3_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS3_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS3_MASK                equ 0008h
APMCLKPPS_APMCLKPPS4_POSN                equ 0004h
APMCLKPPS_APMCLKPPS4_POSITION            equ 0004h
APMCLKPPS_APMCLKPPS4_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS4_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS4_MASK                equ 0010h
APMCLKPPS_APMCLKPPS5_POSN                equ 0005h
APMCLKPPS_APMCLKPPS5_POSITION            equ 0005h
APMCLKPPS_APMCLKPPS5_SIZE                equ 0001h
APMCLKPPS_APMCLKPPS5_LENGTH              equ 0001h
APMCLKPPS_APMCLKPPS5_MASK                equ 0020h
APMCLKPPS_APMCLKPPS_POSN                 equ 0000h
APMCLKPPS_APMCLKPPS_POSITION             equ 0000h
APMCLKPPS_APMCLKPPS_SIZE                 equ 0006h
APMCLKPPS_APMCLKPPS_LENGTH               equ 0006h
APMCLKPPS_APMCLKPPS_MASK                 equ 003Fh

// Register: RB2I2C
#define RB2I2C RB2I2C
RB2I2C                                   equ 0285h
// bitfield definitions
RB2I2C_TH_POSN                           equ 0000h
RB2I2C_TH_POSITION                       equ 0000h
RB2I2C_TH_SIZE                           equ 0002h
RB2I2C_TH_LENGTH                         equ 0002h
RB2I2C_TH_MASK                           equ 0003h
RB2I2C_PU_POSN                           equ 0004h
RB2I2C_PU_POSITION                       equ 0004h
RB2I2C_PU_SIZE                           equ 0002h
RB2I2C_PU_LENGTH                         equ 0002h
RB2I2C_PU_MASK                           equ 0030h
RB2I2C_SLEW_POSN                         equ 0006h
RB2I2C_SLEW_POSITION                     equ 0006h
RB2I2C_SLEW_SIZE                         equ 0002h
RB2I2C_SLEW_LENGTH                       equ 0002h
RB2I2C_SLEW_MASK                         equ 00C0h
RB2I2C_TH0_POSN                          equ 0000h
RB2I2C_TH0_POSITION                      equ 0000h
RB2I2C_TH0_SIZE                          equ 0001h
RB2I2C_TH0_LENGTH                        equ 0001h
RB2I2C_TH0_MASK                          equ 0001h
RB2I2C_TH1_POSN                          equ 0001h
RB2I2C_TH1_POSITION                      equ 0001h
RB2I2C_TH1_SIZE                          equ 0001h
RB2I2C_TH1_LENGTH                        equ 0001h
RB2I2C_TH1_MASK                          equ 0002h
RB2I2C_PU0_POSN                          equ 0004h
RB2I2C_PU0_POSITION                      equ 0004h
RB2I2C_PU0_SIZE                          equ 0001h
RB2I2C_PU0_LENGTH                        equ 0001h
RB2I2C_PU0_MASK                          equ 0010h
RB2I2C_PU1_POSN                          equ 0005h
RB2I2C_PU1_POSITION                      equ 0005h
RB2I2C_PU1_SIZE                          equ 0001h
RB2I2C_PU1_LENGTH                        equ 0001h
RB2I2C_PU1_MASK                          equ 0020h
RB2I2C_SLEW0_POSN                        equ 0006h
RB2I2C_SLEW0_POSITION                    equ 0006h
RB2I2C_SLEW0_SIZE                        equ 0001h
RB2I2C_SLEW0_LENGTH                      equ 0001h
RB2I2C_SLEW0_MASK                        equ 0040h
RB2I2C_SLEW1_POSN                        equ 0007h
RB2I2C_SLEW1_POSITION                    equ 0007h
RB2I2C_SLEW1_SIZE                        equ 0001h
RB2I2C_SLEW1_LENGTH                      equ 0001h
RB2I2C_SLEW1_MASK                        equ 0080h
RB2I2C_I2CTH_POSN                        equ 0000h
RB2I2C_I2CTH_POSITION                    equ 0000h
RB2I2C_I2CTH_SIZE                        equ 0002h
RB2I2C_I2CTH_LENGTH                      equ 0002h
RB2I2C_I2CTH_MASK                        equ 0003h
RB2I2C_I2CPU_POSN                        equ 0004h
RB2I2C_I2CPU_POSITION                    equ 0004h
RB2I2C_I2CPU_SIZE                        equ 0002h
RB2I2C_I2CPU_LENGTH                      equ 0002h
RB2I2C_I2CPU_MASK                        equ 0030h
RB2I2C_I2CSLEW_POSN                      equ 0006h
RB2I2C_I2CSLEW_POSITION                  equ 0006h
RB2I2C_I2CSLEW_SIZE                      equ 0002h
RB2I2C_I2CSLEW_LENGTH                    equ 0002h
RB2I2C_I2CSLEW_MASK                      equ 00C0h
RB2I2C_I2CTH0_POSN                       equ 0000h
RB2I2C_I2CTH0_POSITION                   equ 0000h
RB2I2C_I2CTH0_SIZE                       equ 0001h
RB2I2C_I2CTH0_LENGTH                     equ 0001h
RB2I2C_I2CTH0_MASK                       equ 0001h
RB2I2C_I2CTH1_POSN                       equ 0001h
RB2I2C_I2CTH1_POSITION                   equ 0001h
RB2I2C_I2CTH1_SIZE                       equ 0001h
RB2I2C_I2CTH1_LENGTH                     equ 0001h
RB2I2C_I2CTH1_MASK                       equ 0002h
RB2I2C_I2CPU0_POSN                       equ 0004h
RB2I2C_I2CPU0_POSITION                   equ 0004h
RB2I2C_I2CPU0_SIZE                       equ 0001h
RB2I2C_I2CPU0_LENGTH                     equ 0001h
RB2I2C_I2CPU0_MASK                       equ 0010h
RB2I2C_I2CPU1_POSN                       equ 0005h
RB2I2C_I2CPU1_POSITION                   equ 0005h
RB2I2C_I2CPU1_SIZE                       equ 0001h
RB2I2C_I2CPU1_LENGTH                     equ 0001h
RB2I2C_I2CPU1_MASK                       equ 0020h
RB2I2C_I2CSLEW0_POSN                     equ 0006h
RB2I2C_I2CSLEW0_POSITION                 equ 0006h
RB2I2C_I2CSLEW0_SIZE                     equ 0001h
RB2I2C_I2CSLEW0_LENGTH                   equ 0001h
RB2I2C_I2CSLEW0_MASK                     equ 0040h
RB2I2C_I2CSLEW1_POSN                     equ 0007h
RB2I2C_I2CSLEW1_POSITION                 equ 0007h
RB2I2C_I2CSLEW1_SIZE                     equ 0001h
RB2I2C_I2CSLEW1_LENGTH                   equ 0001h
RB2I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RB1I2C
#define RB1I2C RB1I2C
RB1I2C                                   equ 0286h
// bitfield definitions
RB1I2C_TH_POSN                           equ 0000h
RB1I2C_TH_POSITION                       equ 0000h
RB1I2C_TH_SIZE                           equ 0002h
RB1I2C_TH_LENGTH                         equ 0002h
RB1I2C_TH_MASK                           equ 0003h
RB1I2C_PU_POSN                           equ 0004h
RB1I2C_PU_POSITION                       equ 0004h
RB1I2C_PU_SIZE                           equ 0002h
RB1I2C_PU_LENGTH                         equ 0002h
RB1I2C_PU_MASK                           equ 0030h
RB1I2C_SLEW_POSN                         equ 0006h
RB1I2C_SLEW_POSITION                     equ 0006h
RB1I2C_SLEW_SIZE                         equ 0002h
RB1I2C_SLEW_LENGTH                       equ 0002h
RB1I2C_SLEW_MASK                         equ 00C0h
RB1I2C_TH0_POSN                          equ 0000h
RB1I2C_TH0_POSITION                      equ 0000h
RB1I2C_TH0_SIZE                          equ 0001h
RB1I2C_TH0_LENGTH                        equ 0001h
RB1I2C_TH0_MASK                          equ 0001h
RB1I2C_TH1_POSN                          equ 0001h
RB1I2C_TH1_POSITION                      equ 0001h
RB1I2C_TH1_SIZE                          equ 0001h
RB1I2C_TH1_LENGTH                        equ 0001h
RB1I2C_TH1_MASK                          equ 0002h
RB1I2C_PU0_POSN                          equ 0004h
RB1I2C_PU0_POSITION                      equ 0004h
RB1I2C_PU0_SIZE                          equ 0001h
RB1I2C_PU0_LENGTH                        equ 0001h
RB1I2C_PU0_MASK                          equ 0010h
RB1I2C_PU1_POSN                          equ 0005h
RB1I2C_PU1_POSITION                      equ 0005h
RB1I2C_PU1_SIZE                          equ 0001h
RB1I2C_PU1_LENGTH                        equ 0001h
RB1I2C_PU1_MASK                          equ 0020h
RB1I2C_SLEW0_POSN                        equ 0006h
RB1I2C_SLEW0_POSITION                    equ 0006h
RB1I2C_SLEW0_SIZE                        equ 0001h
RB1I2C_SLEW0_LENGTH                      equ 0001h
RB1I2C_SLEW0_MASK                        equ 0040h
RB1I2C_SLEW1_POSN                        equ 0007h
RB1I2C_SLEW1_POSITION                    equ 0007h
RB1I2C_SLEW1_SIZE                        equ 0001h
RB1I2C_SLEW1_LENGTH                      equ 0001h
RB1I2C_SLEW1_MASK                        equ 0080h
RB1I2C_I2CTH_POSN                        equ 0000h
RB1I2C_I2CTH_POSITION                    equ 0000h
RB1I2C_I2CTH_SIZE                        equ 0002h
RB1I2C_I2CTH_LENGTH                      equ 0002h
RB1I2C_I2CTH_MASK                        equ 0003h
RB1I2C_I2CPU_POSN                        equ 0004h
RB1I2C_I2CPU_POSITION                    equ 0004h
RB1I2C_I2CPU_SIZE                        equ 0002h
RB1I2C_I2CPU_LENGTH                      equ 0002h
RB1I2C_I2CPU_MASK                        equ 0030h
RB1I2C_I2CSLEW_POSN                      equ 0006h
RB1I2C_I2CSLEW_POSITION                  equ 0006h
RB1I2C_I2CSLEW_SIZE                      equ 0002h
RB1I2C_I2CSLEW_LENGTH                    equ 0002h
RB1I2C_I2CSLEW_MASK                      equ 00C0h
RB1I2C_I2CTH0_POSN                       equ 0000h
RB1I2C_I2CTH0_POSITION                   equ 0000h
RB1I2C_I2CTH0_SIZE                       equ 0001h
RB1I2C_I2CTH0_LENGTH                     equ 0001h
RB1I2C_I2CTH0_MASK                       equ 0001h
RB1I2C_I2CTH1_POSN                       equ 0001h
RB1I2C_I2CTH1_POSITION                   equ 0001h
RB1I2C_I2CTH1_SIZE                       equ 0001h
RB1I2C_I2CTH1_LENGTH                     equ 0001h
RB1I2C_I2CTH1_MASK                       equ 0002h
RB1I2C_I2CPU0_POSN                       equ 0004h
RB1I2C_I2CPU0_POSITION                   equ 0004h
RB1I2C_I2CPU0_SIZE                       equ 0001h
RB1I2C_I2CPU0_LENGTH                     equ 0001h
RB1I2C_I2CPU0_MASK                       equ 0010h
RB1I2C_I2CPU1_POSN                       equ 0005h
RB1I2C_I2CPU1_POSITION                   equ 0005h
RB1I2C_I2CPU1_SIZE                       equ 0001h
RB1I2C_I2CPU1_LENGTH                     equ 0001h
RB1I2C_I2CPU1_MASK                       equ 0020h
RB1I2C_I2CSLEW0_POSN                     equ 0006h
RB1I2C_I2CSLEW0_POSITION                 equ 0006h
RB1I2C_I2CSLEW0_SIZE                     equ 0001h
RB1I2C_I2CSLEW0_LENGTH                   equ 0001h
RB1I2C_I2CSLEW0_MASK                     equ 0040h
RB1I2C_I2CSLEW1_POSN                     equ 0007h
RB1I2C_I2CSLEW1_POSITION                 equ 0007h
RB1I2C_I2CSLEW1_SIZE                     equ 0001h
RB1I2C_I2CSLEW1_LENGTH                   equ 0001h
RB1I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 0287h
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0002h
RC4I2C_SLEW_LENGTH                       equ 0002h
RC4I2C_SLEW_MASK                         equ 00C0h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_PU0_POSN                          equ 0004h
RC4I2C_PU0_POSITION                      equ 0004h
RC4I2C_PU0_SIZE                          equ 0001h
RC4I2C_PU0_LENGTH                        equ 0001h
RC4I2C_PU0_MASK                          equ 0010h
RC4I2C_PU1_POSN                          equ 0005h
RC4I2C_PU1_POSITION                      equ 0005h
RC4I2C_PU1_SIZE                          equ 0001h
RC4I2C_PU1_LENGTH                        equ 0001h
RC4I2C_PU1_MASK                          equ 0020h
RC4I2C_SLEW0_POSN                        equ 0006h
RC4I2C_SLEW0_POSITION                    equ 0006h
RC4I2C_SLEW0_SIZE                        equ 0001h
RC4I2C_SLEW0_LENGTH                      equ 0001h
RC4I2C_SLEW0_MASK                        equ 0040h
RC4I2C_SLEW1_POSN                        equ 0007h
RC4I2C_SLEW1_POSITION                    equ 0007h
RC4I2C_SLEW1_SIZE                        equ 0001h
RC4I2C_SLEW1_LENGTH                      equ 0001h
RC4I2C_SLEW1_MASK                        equ 0080h
RC4I2C_I2CTH_POSN                        equ 0000h
RC4I2C_I2CTH_POSITION                    equ 0000h
RC4I2C_I2CTH_SIZE                        equ 0002h
RC4I2C_I2CTH_LENGTH                      equ 0002h
RC4I2C_I2CTH_MASK                        equ 0003h
RC4I2C_I2CPU_POSN                        equ 0004h
RC4I2C_I2CPU_POSITION                    equ 0004h
RC4I2C_I2CPU_SIZE                        equ 0002h
RC4I2C_I2CPU_LENGTH                      equ 0002h
RC4I2C_I2CPU_MASK                        equ 0030h
RC4I2C_I2CSLEW_POSN                      equ 0006h
RC4I2C_I2CSLEW_POSITION                  equ 0006h
RC4I2C_I2CSLEW_SIZE                      equ 0002h
RC4I2C_I2CSLEW_LENGTH                    equ 0002h
RC4I2C_I2CSLEW_MASK                      equ 00C0h
RC4I2C_I2CTH0_POSN                       equ 0000h
RC4I2C_I2CTH0_POSITION                   equ 0000h
RC4I2C_I2CTH0_SIZE                       equ 0001h
RC4I2C_I2CTH0_LENGTH                     equ 0001h
RC4I2C_I2CTH0_MASK                       equ 0001h
RC4I2C_I2CTH1_POSN                       equ 0001h
RC4I2C_I2CTH1_POSITION                   equ 0001h
RC4I2C_I2CTH1_SIZE                       equ 0001h
RC4I2C_I2CTH1_LENGTH                     equ 0001h
RC4I2C_I2CTH1_MASK                       equ 0002h
RC4I2C_I2CPU0_POSN                       equ 0004h
RC4I2C_I2CPU0_POSITION                   equ 0004h
RC4I2C_I2CPU0_SIZE                       equ 0001h
RC4I2C_I2CPU0_LENGTH                     equ 0001h
RC4I2C_I2CPU0_MASK                       equ 0010h
RC4I2C_I2CPU1_POSN                       equ 0005h
RC4I2C_I2CPU1_POSITION                   equ 0005h
RC4I2C_I2CPU1_SIZE                       equ 0001h
RC4I2C_I2CPU1_LENGTH                     equ 0001h
RC4I2C_I2CPU1_MASK                       equ 0020h
RC4I2C_I2CSLEW0_POSN                     equ 0006h
RC4I2C_I2CSLEW0_POSITION                 equ 0006h
RC4I2C_I2CSLEW0_SIZE                     equ 0001h
RC4I2C_I2CSLEW0_LENGTH                   equ 0001h
RC4I2C_I2CSLEW0_MASK                     equ 0040h
RC4I2C_I2CSLEW1_POSN                     equ 0007h
RC4I2C_I2CSLEW1_POSITION                 equ 0007h
RC4I2C_I2CSLEW1_SIZE                     equ 0001h
RC4I2C_I2CSLEW1_LENGTH                   equ 0001h
RC4I2C_I2CSLEW1_MASK                     equ 0080h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 0288h
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0002h
RC3I2C_SLEW_LENGTH                       equ 0002h
RC3I2C_SLEW_MASK                         equ 00C0h
RC3I2C_TH0_POSN                          equ 0000h
RC3I2C_TH0_POSITION                      equ 0000h
RC3I2C_TH0_SIZE                          equ 0001h
RC3I2C_TH0_LENGTH                        equ 0001h
RC3I2C_TH0_MASK                          equ 0001h
RC3I2C_TH1_POSN                          equ 0001h
RC3I2C_TH1_POSITION                      equ 0001h
RC3I2C_TH1_SIZE                          equ 0001h
RC3I2C_TH1_LENGTH                        equ 0001h
RC3I2C_TH1_MASK                          equ 0002h
RC3I2C_PU0_POSN                          equ 0004h
RC3I2C_PU0_POSITION                      equ 0004h
RC3I2C_PU0_SIZE                          equ 0001h
RC3I2C_PU0_LENGTH                        equ 0001h
RC3I2C_PU0_MASK                          equ 0010h
RC3I2C_PU1_POSN                          equ 0005h
RC3I2C_PU1_POSITION                      equ 0005h
RC3I2C_PU1_SIZE                          equ 0001h
RC3I2C_PU1_LENGTH                        equ 0001h
RC3I2C_PU1_MASK                          equ 0020h
RC3I2C_SLEW0_POSN                        equ 0006h
RC3I2C_SLEW0_POSITION                    equ 0006h
RC3I2C_SLEW0_SIZE                        equ 0001h
RC3I2C_SLEW0_LENGTH                      equ 0001h
RC3I2C_SLEW0_MASK                        equ 0040h
RC3I2C_SLEW1_POSN                        equ 0007h
RC3I2C_SLEW1_POSITION                    equ 0007h
RC3I2C_SLEW1_SIZE                        equ 0001h
RC3I2C_SLEW1_LENGTH                      equ 0001h
RC3I2C_SLEW1_MASK                        equ 0080h
RC3I2C_I2CTH_POSN                        equ 0000h
RC3I2C_I2CTH_POSITION                    equ 0000h
RC3I2C_I2CTH_SIZE                        equ 0002h
RC3I2C_I2CTH_LENGTH                      equ 0002h
RC3I2C_I2CTH_MASK                        equ 0003h
RC3I2C_I2CPU_POSN                        equ 0004h
RC3I2C_I2CPU_POSITION                    equ 0004h
RC3I2C_I2CPU_SIZE                        equ 0002h
RC3I2C_I2CPU_LENGTH                      equ 0002h
RC3I2C_I2CPU_MASK                        equ 0030h
RC3I2C_I2CSLEW_POSN                      equ 0006h
RC3I2C_I2CSLEW_POSITION                  equ 0006h
RC3I2C_I2CSLEW_SIZE                      equ 0002h
RC3I2C_I2CSLEW_LENGTH                    equ 0002h
RC3I2C_I2CSLEW_MASK                      equ 00C0h
RC3I2C_I2CTH0_POSN                       equ 0000h
RC3I2C_I2CTH0_POSITION                   equ 0000h
RC3I2C_I2CTH0_SIZE                       equ 0001h
RC3I2C_I2CTH0_LENGTH                     equ 0001h
RC3I2C_I2CTH0_MASK                       equ 0001h
RC3I2C_I2CTH1_POSN                       equ 0001h
RC3I2C_I2CTH1_POSITION                   equ 0001h
RC3I2C_I2CTH1_SIZE                       equ 0001h
RC3I2C_I2CTH1_LENGTH                     equ 0001h
RC3I2C_I2CTH1_MASK                       equ 0002h
RC3I2C_I2CPU0_POSN                       equ 0004h
RC3I2C_I2CPU0_POSITION                   equ 0004h
RC3I2C_I2CPU0_SIZE                       equ 0001h
RC3I2C_I2CPU0_LENGTH                     equ 0001h
RC3I2C_I2CPU0_MASK                       equ 0010h
RC3I2C_I2CPU1_POSN                       equ 0005h
RC3I2C_I2CPU1_POSITION                   equ 0005h
RC3I2C_I2CPU1_SIZE                       equ 0001h
RC3I2C_I2CPU1_LENGTH                     equ 0001h
RC3I2C_I2CPU1_MASK                       equ 0020h
RC3I2C_I2CSLEW0_POSN                     equ 0006h
RC3I2C_I2CSLEW0_POSITION                 equ 0006h
RC3I2C_I2CSLEW0_SIZE                     equ 0001h
RC3I2C_I2CSLEW0_LENGTH                   equ 0001h
RC3I2C_I2CSLEW0_MASK                     equ 0040h
RC3I2C_I2CSLEW1_POSN                     equ 0007h
RC3I2C_I2CSLEW1_POSITION                 equ 0007h
RC3I2C_I2CSLEW1_SIZE                     equ 0001h
RC3I2C_I2CSLEW1_LENGTH                   equ 0001h
RC3I2C_I2CSLEW1_MASK                     equ 0080h

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
I2C1RXB                                  equ 0289h
// bitfield definitions
I2C1RXB_RXB_POSN                         equ 0000h
I2C1RXB_RXB_POSITION                     equ 0000h
I2C1RXB_RXB_SIZE                         equ 0008h
I2C1RXB_RXB_LENGTH                       equ 0008h
I2C1RXB_RXB_MASK                         equ 00FFh

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
I2C1TXB                                  equ 028Ah
// bitfield definitions
I2C1TXB_TXB_POSN                         equ 0000h
I2C1TXB_TXB_POSITION                     equ 0000h
I2C1TXB_TXB_SIZE                         equ 0008h
I2C1TXB_TXB_LENGTH                       equ 0008h
I2C1TXB_TXB_MASK                         equ 00FFh

