garyPenhook/PIC-Assembler/device_includes/pic18f45q71.inc
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQ7                            BANKMASK(DMAnSIRQ), 7, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SLCT2                            BANKMASK(CLCSELECT), 2, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SMA                              BANKMASK(I2C1STAT0), 6, b
#define SMP                              BANKMASK(SPI1CON1), 7, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SOSIE                            BANKMASK(SPI1INTE), 5, b
#define SOSIF                            BANKMASK(SPI1INTF), 5, b
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLKSEL4                      BANKMASK(SPI1CLK), 4, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
#define SPI1IF                           BANKMASK(PIR3), 2, a
#define SPI1IP                           BANKMASK(IPR3), 2, a
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD3), 4, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE3), 0, a
#define SPI1RXIF                         BANKMASK(PIR3), 0, a
#define SPI1RXIP                         BANKMASK(IPR3), 0, a
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SCKPPS5                      BANKMASK(SPI1SCKPPS), 5, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDIPPS5                      BANKMASK(SPI1SDIPPS), 5, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1SSPPS5                       BANKMASK(SPI1SSPPS), 5, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE3), 1, a
#define SPI1TXIF                         BANKMASK(PIR3), 1, a
#define SPI1TXIP                         BANKMASK(IPR3), 1, a
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPTR0                            BANKMASK(DMAnSPTRL), 0, b
#define SPTR1                            BANKMASK(DMAnSPTRL), 1, b
#define SPTR10                           BANKMASK(DMAnSPTRH), 2, b
#define SPTR11                           BANKMASK(DMAnSPTRH), 3, b
#define SPTR12                           BANKMASK(DMAnSPTRH), 4, b
#define SPTR13                           BANKMASK(DMAnSPTRH), 5, b
#define SPTR14                           BANKMASK(DMAnSPTRH), 6, b
#define SPTR15                           BANKMASK(DMAnSPTRH), 7, b
#define SPTR16                           BANKMASK(DMAnSPTRU), 0, b
#define SPTR17                           BANKMASK(DMAnSPTRU), 1, b
#define SPTR18                           BANKMASK(DMAnSPTRU), 2, b
#define SPTR19                           BANKMASK(DMAnSPTRU), 3, b
#define SPTR2                            BANKMASK(DMAnSPTRL), 2, b
#define SPTR20                           BANKMASK(DMAnSPTRU), 4, b
#define SPTR21                           BANKMASK(DMAnSPTRU), 5, b
#define SPTR3                            BANKMASK(DMAnSPTRL), 3, b
#define SPTR4                            BANKMASK(DMAnSPTRL), 4, b
#define SPTR5                            BANKMASK(DMAnSPTRL), 5, b
#define SPTR6                            BANKMASK(DMAnSPTRL), 6, b
#define SPTR7                            BANKMASK(DMAnSPTRL), 7, b
#define SPTR8                            BANKMASK(DMAnSPTRH), 0, b
#define SPTR9                            BANKMASK(DMAnSPTRH), 1, b
#define SRMTIE                           BANKMASK(SPI1INTE), 7, b
#define SRMTIF                           BANKMASK(SPI1INTF), 7, b
#define SSA0                             BANKMASK(DMAnSSAL), 0, b
#define SSA1                             BANKMASK(DMAnSSAL), 1, b
#define SSA10                            BANKMASK(DMAnSSAH), 2, b
#define SSA11                            BANKMASK(DMAnSSAH), 3, b
#define SSA12                            BANKMASK(DMAnSSAH), 4, b
#define SSA13                            BANKMASK(DMAnSSAH), 5, b
#define SSA14                            BANKMASK(DMAnSSAH), 6, b
#define SSA15                            BANKMASK(DMAnSSAH), 7, b
#define SSA16                            BANKMASK(DMAnSSAU), 0, b
#define SSA17                            BANKMASK(DMAnSSAU), 1, b
#define SSA18                            BANKMASK(DMAnSSAU), 2, b
#define SSA19                            BANKMASK(DMAnSSAU), 3, b
#define SSA2                             BANKMASK(DMAnSSAL), 2, b
#define SSA20                            BANKMASK(DMAnSSAU), 4, b
#define SSA21                            BANKMASK(DMAnSSAU), 5, b
#define SSA3                             BANKMASK(DMAnSSAL), 3, b
#define SSA4                             BANKMASK(DMAnSSAL), 4, b
#define SSA5                             BANKMASK(DMAnSSAL), 5, b
#define SSA6                             BANKMASK(DMAnSSAL), 6, b
#define SSA7                             BANKMASK(DMAnSSAL), 7, b
#define SSA8                             BANKMASK(DMAnSSAH), 0, b
#define SSA9                             BANKMASK(DMAnSSAH), 1, b
#define SSET                             BANKMASK(SPI1CON2), 2, b
#define SSFLT                            BANKMASK(SPI1CON2), 6, b
#define SSP                              BANKMASK(SPI1CON1), 2, b
#define SSTP                             BANKMASK(DMAnCON1), 0, b
#define SSZ0                             BANKMASK(DMAnSSZL), 0, b
#define SSZ1                             BANKMASK(DMAnSSZL), 1, b
#define SSZ10                            BANKMASK(DMAnSSZH), 2, b
#define SSZ11                            BANKMASK(DMAnSSZH), 3, b
#define SSZ2                             BANKMASK(DMAnSSZL), 2, b
#define SSZ3                             BANKMASK(DMAnSSZL), 3, b
#define SSZ4                             BANKMASK(DMAnSSZL), 4, b
#define SSZ5                             BANKMASK(DMAnSSZL), 5, b
#define SSZ6                             BANKMASK(DMAnSSZL), 6, b
#define SSZ7                             BANKMASK(DMAnSSZL), 7, b
#define SSZ8                             BANKMASK(DMAnSSZH), 0, b
#define SSZ9                             BANKMASK(DMAnSSZH), 1, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKPTR5                          BANKMASK(STKPTR), 5, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define STRA                             BANKMASK(CWG1STR), 0, b
#define STRB                             BANKMASK(CWG1STR), 1, b
#define STRC                             BANKMASK(CWG1STR), 2, b
#define STRD                             BANKMASK(CWG1STR), 3, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, a
#define SWIF                             BANKMASK(PIR0), 0, a
#define SWIP                             BANKMASK(IPR0), 0, a
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, b
#define T0ASYNC                          BANKMASK(T0CON1), 4, b
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4, b
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, b
#define T0CKPS1                          BANKMASK(T0CON1), 1, b
#define T0CKPS2                          BANKMASK(T0CON1), 2, b
#define T0CKPS3                          BANKMASK(T0CON1), 3, b
#define T0CS0                            BANKMASK(T0CON1), 5, b
#define T0CS1                            BANKMASK(T0CON1), 6, b
#define T0CS2                            BANKMASK(T0CON1), 7, b
#define T0EN                             BANKMASK(T0CON0), 7, b
#define T0MD16                           BANKMASK(T0CON0), 4, b
#define T0OUT                            BANKMASK(T0CON0), 5, b
#define T0OUTPS0                         BANKMASK(T0CON0), 0, b
#define T0OUTPS1                         BANKMASK(T0CON0), 1, b
#define T0OUTPS2                         BANKMASK(T0CON0), 2, b
#define T0OUTPS3                         BANKMASK(T0CON0), 3, b
#define T0PR0                            BANKMASK(TMR0H), 0, b
#define T0PR1                            BANKMASK(TMR0H), 1, b
#define T0PR2                            BANKMASK(TMR0H), 2, b
#define T0PR3                            BANKMASK(TMR0H), 3, b
#define T0PR4                            BANKMASK(TMR0H), 4, b
#define T0PR5                            BANKMASK(TMR0H), 5, b
#define T0PR6                            BANKMASK(TMR0H), 6, b
#define T0PR7                            BANKMASK(TMR0H), 7, b
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5, b
#define T1CKPS0                          BANKMASK(T1CON), 4, b
#define T1CKPS1                          BANKMASK(T1CON), 5, b
#define T1CS0                            BANKMASK(T1CLK), 0, b
#define T1CS1                            BANKMASK(T1CLK), 1, b
#define T1CS2                            BANKMASK(T1CLK), 2, b
#define T1CS3                            BANKMASK(T1CLK), 3, b
#define T1CS4                            BANKMASK(T1CLK), 4, b
#define T1GE                             BANKMASK(T1GCON), 7, b
#define T1GGO                            BANKMASK(T1GCON), 3, b
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, b
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, b
#define T1GPOL                           BANKMASK(T1GCON), 6, b
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GPPS5                          BANKMASK(T1GPPS), 5, b
#define T1GSPM                           BANKMASK(T1GCON), 4, b
#define T1GSS0                           BANKMASK(T1GATE), 0, b
#define T1GSS1                           BANKMASK(T1GATE), 1, b
#define T1GSS2                           BANKMASK(T1GATE), 2, b
#define T1GSS3                           BANKMASK(T1GATE), 3, b
#define T1GSS4                           BANKMASK(T1GATE), 4, b
#define T1GTM                            BANKMASK(T1GCON), 5, b
#define T1GVAL                           BANKMASK(T1GCON), 2, b
#define T1RD16                           BANKMASK(T1CON), 1, b
#define T2CKPOL                          BANKMASK(T2HLT), 6, b
#define T2CKPS0                          BANKMASK(T2CON), 4, b
#define T2CKPS1                          BANKMASK(T2CON), 5, b
#define T2CKPS2                          BANKMASK(T2CON), 6, b
#define T2CKSYNC                         BANKMASK(T2HLT), 5, b
#define T2CS0                            BANKMASK(T2CLKCON), 0, b
#define T2CS1                            BANKMASK(T2CLKCON), 1, b
#define T2CS2                            BANKMASK(T2CLKCON), 2, b
#define T2CS3                            BANKMASK(T2CLKCON), 3, b
#define T2CS4                            BANKMASK(T2CLKCON), 4, b
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2INPPS5                         BANKMASK(T2INPPS), 5, b
#define T2MODE0                          BANKMASK(T2HLT), 0, b
#define T2MODE1                          BANKMASK(T2HLT), 1, b
#define T2MODE2                          BANKMASK(T2HLT), 2, b
#define T2MODE3                          BANKMASK(T2HLT), 3, b
#define T2MODE4                          BANKMASK(T2HLT), 4, b
#define T2ON                             BANKMASK(T2CON), 7, b
#define T2OUTPS0                         BANKMASK(T2CON), 0, b
#define T2OUTPS1                         BANKMASK(T2CON), 1, b
#define T2OUTPS2                         BANKMASK(T2CON), 2, b
#define T2OUTPS3                         BANKMASK(T2CON), 3, b
#define T2PSYNC                          BANKMASK(T2HLT), 7, b
#define T2RSEL0                          BANKMASK(T2RST), 0, b
#define T2RSEL1                          BANKMASK(T2RST), 1, b
#define T2RSEL2                          BANKMASK(T2RST), 2, b
#define T2RSEL3                          BANKMASK(T2RST), 3, b
#define T2RSEL4                          BANKMASK(T2RST), 4, b
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKIPPS5                        BANKMASK(T3CKIPPS), 5, b
#define T3CKPS0                          BANKMASK(T3CON), 4, b
#define T3CKPS1                          BANKMASK(T3CON), 5, b
#define T3CS0                            BANKMASK(T3CLK), 0, b
#define T3CS1                            BANKMASK(T3CLK), 1, b
#define T3CS2                            BANKMASK(T3CLK), 2, b
#define T3CS3                            BANKMASK(T3CLK), 3, b
#define T3CS4                            BANKMASK(T3CLK), 4, b
#define T3GE                             BANKMASK(T3GCON), 7, b
#define T3GGO                            BANKMASK(T3GCON), 3, b
#define T3GGO_NOT_DONE                   BANKMASK(T3GCON), 3, b
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3, b
#define T3GPOL                           BANKMASK(T3GCON), 6, b
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GPPS5                          BANKMASK(T3GPPS), 5, b
#define T3GSPM                           BANKMASK(T3GCON), 4, b
#define T3GSS0                           BANKMASK(T3GATE), 0, b
#define T3GSS1                           BANKMASK(T3GATE), 1, b
#define T3GSS2                           BANKMASK(T3GATE), 2, b
#define T3GSS3                           BANKMASK(T3GATE), 3, b
#define T3GSS4                           BANKMASK(T3GATE), 4, b
#define T3GTM                            BANKMASK(T3GCON), 5, b
#define T3GVAL                           BANKMASK(T3GCON), 2, b
#define T3RD16                           BANKMASK(T3CON), 1, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4CS4                            BANKMASK(T4CLKCON), 4, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
